// 正数、一位小数
export let verifyFigure = /^(0|\d{1,}|(0|[1-9]*)+(\.[0-9]{1,1})|([1-9]\d*))?$/;

// 正数
export let verifyPlus = /^(0|\d{1,}|(0|[1-9]*)+(\.[0-9]{1,})|([1-9]\d*))?$/;

// 正负数 
export let verifyPlusMinus = /^-?(0|\d{1,}|(0|[1-9]*)+(\.[0-9]{1,1})|([1-9]\d*))?$/;

// 正整数
export let verifyInt = /^(0|\d{1,}|)$/;

// 整数
export let verifyInteger = /^(0|-?\d{1,}|)$/;

// 数字在0~100小数保留两位小数
export let verify_0_100 = /^(\d{1,2}(\.\d{1,2})?|100|100\.0|100\.00)$/;

// 电话
export let verifyPhone = /^1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}$/;

// 电话组
// export let verifyPhones = /(^(13[0-9]|15[0|1|3|6|7|8|9]|18[8|9])\d{8}[\r\n]?$)|(^((13[0-9]|15[0|1|3|6|7|8|9]|18[8|9])\d{8}\,[\r\n]?){2,}$)/;
// export let verifyPhones = /^((13[0-9]|15[0|1|3|6|7|8|9]|18[8|9])\d{8}[\r\n]?)(\,[\r\n]?((13[0-9]|15[0|1|3|6|7|8|9]|18[8|9])\d{8}))*$/;
export let verifyPhones = /^(1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}[\r\n]?)(\,[\r\n]?(1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}))*$/;

// 邮箱
export let verifyEmail = /^([a-zA-Z]|[0-9])(\w|\-)+@[a-zA-Z0-9]+\.([a-zA-Z]{2,4})$/;

// 验证密码 长度为8且至少包含数字、字母、特殊字符两种
export let verifyPwd = /^(?!\d+$)(?!^[a-zA-Z]+$)(?!^[_#@]+$).{8,}$/;
